lol
kind
translat
got
speak
hasbara
kill
jew
continu
gazan
oppress
friendli
fact
remind
israel
steal
palestin
land
bomb
civilian
control
access
kidnap
palestinian
year
commit
genocid
somehow
peopl
like
place
blame
think
hama
bad
news
idf
well
would
never
support
action
could
make
stop
state
isra
west
bank
arab
use
absolut
evid
take
drug
similar
nazi
took
it’
report
multipl
outlet
link
new
york
time
look
said
didnt
give
lie
deni
anyth
doesnt
human
shield
gaza
chose
chang
subject
local
messag
ago
behavior
your
complain
ceas
point
bring
exactli
attack
million
kid
amount
octob
th
gonna
murder
ok
hamass
fault
everi
death
sinc
bullet
singl
die
that
unit
part
person
hand
even
get
shot
secur
guard
charg
one
respons
everyth
happen
result
gun
safeti
child
willingli
put
live
us
act
suddenli
evil
perpetr
innoc
moment
want
theyd
lay
weapon
releas
hostag
surrend
judg
crime
lost
occur
battl
best
scenario
confus
particularli
disgust
right
knew
still
way
allow
possibl
peac
without
ethnic
cleans
oh
guess
children
must
hear
fuck
sound
i’m
pleas
teach
don’t
know
countri
wasn’t
purpos
show
feed
oct
mani
saw
fled
ask
buddi
mention
histor
thought
entir
islam
world
rise
crusad
western
goal
approv
say
return
step
better
taken
room
anymor
terror
stuff
fail
un
leagu
war
start
week
wonder
worth
parti
celebr
hey
fascist
soviet
leader
life
hate
hope
old
tradit
soon
come
dare
vote
elect
weren’t
born
question
obvious
egypt
strip
im
noth
ive
contradict
collect
posit
clearli
didn’t
least
offici
much
alreadi
colon
tell
inde
american
benefit
basic
accus
high
school
you’r
internet
fool
offer
proof
need
check
two
soldier
arrest
convinc
here
yo
boy
go
read
bottom
provid
earlier
exampl
hundr
instanc
theyr
werent
abl
understand
sure
articl
coupl
second
youv
matter
throw
youll
keep
discuss
id
debat
ah
see
view
instead
insan
let
good
tragedi
wast
yet
deserv
lsrael
l
pro
ralli
cant
side
done
crimin
northern
europ
observ
mess
long
seem
btw
comment
aggress
legit
argument
turn
rage
dont
unless
destroy
ye
alway
reason
none
agreement
enough
leadership
demand
full
refuge
demograph
destruct
jewish
precis
honestli
specif
condit
find
excus
declar
unfair
bit
argu
whether
babi
actual
behead
complet
ignor
big
pictur
negoti
interest
coexist
israel’
remov
zero
trade
there’
nobodi
end
current
invas
they’d
written
dead
watch
video
titl
stole
phone
zionist
suppos
type
footag
interview
claim
widespread
tri
ukrain
atroc
page
often
rape
havent
across
settler
minor
regard
religi
follow
he
great
sourc
info
they’r
opportun
wipe
map
young
care
truli
seen
rebellion
retali
houthi
polit
group
pa
program
run
trust
grandfath
wouldn’t
govern
annihil
treat
sub
decad
angri
gt
milit
freed
swap
involv
repeat
cycl
mean
caus
given
back
origin
everyon
christian
solut
displac
pathet
there
around
critic
wont
lead
liber
struggl
isnt
imperialist
fight
resist
project
primarili
nation
also
stand
blood
simpli
unaccept
ill
silent
forget
name
includ
tragic
justifi
base
minim
damag
hold
water
conflict
account
loss
work
toward
resolut
issu
deal
someth
accept
piec
forc
apartheid
wake
proud
centuri
indigen
enter
natur
slaughter
home
burn
aliv
elderli
post
thing
wait
armi
asymmetr
warfar
found
propaganda
journalist
subreddit
spread
final
conclus
admit
media
fine
fire
former
pm
except
openli
normal
relat
twostat
antisemit
seriou
islamophobia
putin
drop
nuke
itll
pretti
stone
stick
definit
realist
option
strike
oslo
accord
sanction
resolv
region
’s
process
launch
suicid
left
evacu
rocket
terrorist
appreci
cannon
thank
wing
realli
believ
women
fundament
islamist
—
intellectu
integr
consid
event
mob
mental
youd
shock
capabl
dehuman
resid
neighborhood
dog
yea
told
law
order
famili
civillian
grant
telegram
promot
respond
can’t
shit
popul
be
power
although
joke
individu
advanc
sometim
soul
first
y’all
tini
number
rich
wealth
immedi
consequ
asid
intern
adult
anyway
neither
age
money
fighter
rest
older
non
secular
univers
educ
girl
focus
creat
environ
fund
men
valuabl
industri
produc
product
servic
rais
econom
resourc
els
import
suggest
medic
technolog
whole
bunch
lot
spend
advantag
depend
anoth
becom
magic
concern
protect
enforc
play
game
short
case
defend
we’r
u
ukrainian
flag
tv
feel
elimin
slowli
push
smaller
fulli
illeg
settlement
appear
fake
someon
probabl
heard
wrong
inform
mass
correct
fals
term
popular
count
dozen
butcher
small
list
exist
combat
youtub
last
abu
deflect
talk
sacrific
“the
readi
pay
higher
price
idea
casualti
guy
quot
plenti
food
fuel
tunnel
maintain
plant
might
mind
begin
sign
treati
gave
sinai
withdraw
occup
prime
minist
decent
histori
attempt
roll
shitti
rule
less
exchang
sad
properti
calm
easier
massacr
save
horribl
desper
surpris
expect
carri
problem
made
quarter
imprison
sent
sentenc
almost
won’t
stay
zone
expos
danger
agre
disagre
amp
worst
holocaust
call
ultim
refus
arent
gener
logic
nativ
justic
nuclear
plan
they’v
cancer
saudi
hous
besid
open
book
harder
that’
fundamentalist
classic
tactic
longer
hot
topic
violat
allegedli
idiot
twist
gay
next
root
religion
assum
repres
suffer
portion
bear
choic
agenda
certainli
necessari
ensur
futur
near
constant
favor
mistak
bullshit
man
flow
etc
ghetto
cannot
leav
freeli
occupi
hide
behind
vagu
simpl
googl
search
opinion
discredit
america
complicit
narr
victim
global
realiti
practic
true
judaism
establish
condon
doubt
figur
sponsor
militari
arm
regim
boycott
politician
class
muslim
“i
random
total
vile
anyon
neg
join
aka
compar
face
known
violent
extremist
activ
howev
cover
head
chanc
free
healthcar
usa
spent
dollar
per
canada
averag
rate
equival
choos
neighbour
assumpt
weird
extract
situat
legitim
naiv
martyr
doubl
will
pull
fellow
began
blockad
thousand
aid
independ
edit
user
repli
appli
love
other
racist
ass
synagogu
day
damn
liter
difficult
form
avoid
particip
jihad
imposs
realis
word
approxim
strive
effort
regular
pray
radic
note
sick
nyc
major
rememb
sympathi
iran
friend
cours
march
street
chant
reliabl
poll
jump
closer
persecut
comfort
financ
field
enemi
valu
success
wtf
stupid
crap
though
fanat
expand
societi
move
help
ga
oil
perform
weak
decis
convers
gain
achiev
violenc
ever
afraid
grow
risk
delet
send
heavili
pressur
stage
warn
bot
shame
liar
sever
descend
citizenship
surround
especi
jordan
larg
syria
directli
crisi
ancestor
indic
expel
trap
footbal
easi
church
shelter
intent
imagin
collater
deep
fought
finish
ton
notic
couldnt
bother
voic
opposit
ongo
democraci
nuanc
advoc
dumb
extrem
dens
white
phosphoru
area
urban
circumst
squar
london
wanna
ahead
job
clean
locat
clear
away
bodi
wouldnt
standard
inhuman
horror
abus
monster
parent
minut
later
i’d
mainli
proven
prosper
threat
prefer
bare
minimum
air
prison
strongli
humanitarian
weve
yell
border
remain
close
citizen
today
littl
pure
planet
suppli
electr
shown
countless
parad
spit
particular
solv
antizionist
propalestinian
donat
recommend
misinform
wasnt
hospit
aren’t
guilti
coloni
iof
hell
share
month
holi
yeah
defin
i’v
label
ran
yep
billion
desalin
nah
genuin
harm
past
shoot
netanyahu
gang
approach
biden
qatar
far
rather
funni
build
pretend
enjoy
lose
democrat
explos
greater
half
usual
expert
missil
offens
mostli
serv
resort
object
mayb
style
protest
brought
plu
organ
otherwis
lgbt
commun
welcom
condemn
atroci
annex
drag
brother
palastinian
wage
win
reject
sadli
test
quick
geneva
convent
concept
erad
expuls
assimil
conquer
victori
perfectli
middl
east
britain
domin
punish
prohama
airport
dagestan
scream
happi
tiktok
togeth
hasnt
german
mediterranean
european
went
nope
couldn’t
self
center
realiz
biggest
bulli
hatr
ceasefir
whatev
quit
identifi
plo
awar
assassin
civil
break
revolt
prove
egyptian
jordanian
unlik
acknowledg
throughout
ground
conspiraci
rabin
strategi
strateg
raid
captur
dig
sea
bet
team
fall
certain
pain
prevent
doesn’t
research
mosqu
motiv
round
differ
explain
unarm
agent
leftist
storm
download
urg
camera
nonsens
reddit
hard
percentag
proport
reveng
dismiss
moral
black
sell
rid
utter
disregard
caught
requir
isn’t
lmao
belief
fit
channel
hebrew
version
english
date
learn
level
folk
sens
fulfil
eventu
collaps
defens
shouldn’t
nice
contribut
answer
kept
invent
target
equat
escap
silenc
disappear
alon
blow
isreal
real
jail
op
pick
vs
luck
shut
beg
ten
troop
sit
truth
injustic
address
built
fear
extermin
likud
add
context
russian
dad
wors
member
russia
imo
f
oppressor
he’
gtthe
theyv
factual
statement
diplomaci
fatah
labor
offic
campaign
poster
imag
set
shout
onto
chief
camp
david
compromis
failur
foreign
present
meet
concess
previous
frustrat
diplomat
faith
govt
polici
seek
consist
arriv
rpalestin
unfortun
submiss
gtno
stori
either
invest
cheer
iron
dome
flee
british
mandat
germani
concentr
morocco
tunisia
barbar
what
savag
frequent
recent
amongst
isi
al
taliban
common
rafah
cross
crazi
propos
armistic
decid
signific
intifada
fairli
scene
due
equal
addit
birth
eat
straight
sorri
experi
social
influenc
chat
dark
mad
starv
zionism
outsid
hit
abraham
travel
arabia
document
scale
credibl
came
serious
agenc
intellig
basi
verifi
fair
nationalist
wound
geopolit
moder
desert
invad
capit
blind
busi
fill
wikipedia
section
bigger
trump
tire
engag
captiv
mission
thailand
held
thai
author
special
rescu
confirm
onlin
flight
toler
hypocrit
commiss
“
paper
partit
belong
immigr
connect
ottoman
block
henc
promis
wild
tax
combin
neighbor
strongest
hero
demonstr
estim
massiv
lebanon
tank
race
career
speech
let’
fli
moron
sister
music
festiv
abandon
write
cite
smart
reach
eye
freedom
light
heart
myth
blown
earli
inhabit
conveni
own
along
declin
ident
typic
italian
despit
becam
recogn
balfour
transfer
council
may
charter
confer
upon
among
legal
vast
tho
redditor
protestor
mere
led
determin
hezbollah
indiscrimin
ban
dictat
mod
platform
troll
bibi
hindu
sort
movement
carrier
react
overwhelm
hour
huge
empir
comparison
iraq
worri
infiltr
insurg
north
design
wall
citi
largest
territori
materi
passag
forth
network
smuggl
sincer
coward
baffl
refer
gtyou
front
migrat
hole
relev
thread
who
brutal
idk
would’v
bunker
isol
alli
embarrass
film
hurt
deliber
insult
valid
instal
ww
french
separ
guid
easili
whoever
sake
experienc
dedic
sky
nowher
mother
prop
populac
buy
knowledg
mossad
domest
affair
cut
septemb
hamma
israelit
sole
sovereign
draw
direct
rel
shouldnt
respect
within
king
ad
notion
safe
k
eastern
african
grew
mile
densiti
daili
pre
load
truck
exclus
fix
lower
dude
brain
okay
presenc
oper
yesterday
what’
swear
proisra
tldr
roman
kingdom
syrian
gtand
bc
grand
hitler
arafat
divid
empathi
earth
vacuum
cri
pij
meanwhil
cancel
tension
riot
mix
quiet
insid
anywher
antisemet
everywher
blatant
…
felt
iraqi
encourag
wide
historian
abba
broke
method
public
jerusalem
key
door
night
describ
messeng
upset
trigger
anim
ben
defenc
chamber
rat
card
main
recruit
forev
preach
percent
atheist
laugh
incred
therefor
mine
wow
record
cultur
pawn
nearli
defeat
gotta
somewher
line
gone
dislik
bloodi
modern
constantli
reform
tortur
exact
attent
yemen
tend
perhap
sympathet
oppos
late
wish
racism
guilt
alongsid
assur
homeland
lynch
complex
perspect
cold
proxi
horrif
walk
path
road
physic
quickli
legitimaci
hint
assist
express
aim
progress
command
carpet
beyond
munit
apart
allah
nobl
expens
poor
machin
top
pop
detail
japanes
son
father
tree
cloth
listen
treatment
uk
goe
text
structur
effect
plane
entiti
scare
loud
danc
appar
hilari
forgiv
algharqad
press
court
river
wb
ampxb
eu
nato
irrelev
highli
pass
south
corrupt
featur
incompet
bomber
analog
kinda
miss
brainwash
regardless
tough
worker
crossfir
initi
shell
investig
complic
improv
endless
breed
dream
impli
pogrom
aggressor
switch
brown
photo
publish
doctor
refut
proper
sieg
wear
whose
chosen
god
obviou
skin
color
bro
hamas’
badli
injur
tabl
kibbutz
execut
car
neutral
haven’t
gotten
shed
exagger
scari
airstrik
energi
pr
forward
fun
africa
asian
garbag
reserv
stock
they’ll
rewrit
cult
jesu
afghanistan
familiar
statu
capac
host
mouth
humili
tbh
strong
genet
incorrect
anti
semit
hostil
corps
incap
honest
ideal
kick
focu
wit
mistreat
worldwid
driven
aw
systemat
develop
ship
ideolog
cost
distanc
vastli
extent
ie
factor
abil
somewhat
overal
super
repress
categor
administr
theyll
irish
convert
intens
–
strang
creation
could’v
town
manag
hunt
bin
laden
reaction
faction
invit
absurd
revers
drive
bigotri
low
hypocrisi
ppl
confid
obliter
whenev
counter
distribut
suck
terrifi
system
rhetor
essenti
unabl
nakba
franc
downvot
intel
qualiti
assault
paint
disput
tel
aviv
stolen
polic
everybodi
select
woman
numer
rock
x
degre
impos
whatabout
content
ethic
terribl
wife
sane
tourist
economi
everyday
lobbi
grab
supremacist
cnn
elon
twitter
compani
bigot
mate
asia
period
lack
permit
construct
facil
infrastructur
grasp
oblig
prior
handl
mask
potenti
condem
communist
chines
pipe
uneduc
background
superior
stab
residenti
toll
stanc
prevail
hq
bless
bs
bibl
propalestin
ur
anybodi
wrote
presum
villag
warcrim
ridicul
dagestani
receiv
studi
backward
impress
expans
privat
dug
amaz
impact
surviv
you’ll
associ
ethiopian
korean
increas
plain
km
track
prophet
paid
deepli
measur
ya
i’ll
finger
canaanit
glad
theori
prais
apolog
accid
whatsoev
ruin
bia
leverag
data
function
organis
farm
tech
health
taught
limit
pump
drink
via
visa
train
tie
endang
escal
yemeni
ancient
troubl
ironi
thu
red
poland
ration
japan
bombard
conduct
heavi
asham
altern
employ
elsewher
ministri
restrict
sentiment
store
fenc
b
echo
oppon
charact
turkey
gta
israelpalestin
shall
safer
yup
lock
yall
broken
incid
disingenu
foot
concret
orthodox
compass
gtisrael
antiisrael
mountain
freak
rip
bulldoz
headlin
crowd
aint
hasn’t
huh
prepar
alot
em
spew
perpetu
staff
variou
persian
turk
couldv
w
prohibit
touch
emot
seiz
bought
discrimin
piss
presid
publicli
desir
gtthey
reli
prioriti
justif
dumbass
pocket
mainstream
coverag
aircraft
trial
china
korea
permiss
extend
puppet
ethnost
equip
debunk
rain
😂
three
checkpoint
accur
till
disproportion
strength
armenian
sudan
chao
gti
vocal
uncondit
accomplish
cool
forcibl
offend
beat
sooner
southern
era
imperi
fell
role
outrag
visit
conserv
fan
reloc
nightmar
bbc
space
constitut
taiwan
languag
latter
controversi
distinct
core
emerg
delusion
lebanes
tool
third
thrive
dna
flood
align
repeatedli
underground
st
nd
depart
bias
secret
mena
silli
technic
outcom
settl
attitud
i
chechnya
militia
betray
fed
interpret
moscow
represent
perceiv
you’v
famou
pack
rout
manufactur
racial
pipelin
torah
perman
republican
survey
forgot
avail
reduc
relief
previou
loser
survivor
relationship
flatten
diaspora
devast
larger
wave
heaven
meant
passport
brotherhood
site
ireland
stuck
appeal
station
roof
growth
brave
slow
indoctrin
dismantl
wwii
proportion
ordinari
formal
judea
gtwhen
patient
challeng
proisrael
warsaw
ashkenazi
quran
mizrahi
grandpar
announc
affect
necessarili
threaten
queer
odd
rare
airspac
c
intend
ancestr
sovereignti
guarante
anger
surgic
coalit
sympath
contact
inevit
unrel
jazeera
ss
undermin
rd
chemic
pvc
pakistan
enabl
appropri
sleep
frankli
aquif
brag
somebodi
feet
institut
drone
portray
bloodsh
indian
explan
chicken
analysi
duti
asshol
met
deploy
denial
inflat
perfect
student
knock
iranian
succeed
simultan
discours
behav
palestinan
understood
supposedli
curiou
contain
financi
🤣
india
beauti
teenag
militarili
agricultur
fate
rubbl
tear
tower
memori
andor
automat
manipul
mark
unbias
spot
hmm
chechen
rebuild
stronger
happend
vers
restor
supremaci
teacher
berlin
box
corner
blah
infantri
interven
israël
moslem
inflict
profit
stockpil
ethiopia
philistin
rural
ark